#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Есть словарь координат городов

sites = {
    'Moscow': (550, 370),
    'London': (510, 510),
    'Paris': (480, 480),
}

# Составим словарь словарей расстояний между ними
# расстояние на координатной сетке - корень из (x1 - x2) ** 2 + (y1 - y2) ** 2

distances = {
    'Moscow to London': ((((550 - 510) ** 2) + ((370 - 510) ** 2)) ** 0.5),
    'London to Paris': ((((510 - 480) ** 2) + ((510 - 480) ** 2)) ** 0.5),
    'Paris to Moscow': ((((480 - 550) ** 2) + ((480 - 370) ** 2)) ** 0.5),

}


print(distances)




